# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# cst-yolo backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],  

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4

   [-1, 1, Conv, [64, 1, 1]],  # W-ELAN 1
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, MyConcat4, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11

   [-1, 1, Conv, [256, 3, 2]],  # CBSConcat (MP->Conv)
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8
  

   [-1, 1, Conv, [128, 1, 1]],  # W-ELAN 1
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, MyConcat4, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 25

   [-1, 1, Conv, [256, 3, 2]],  # CBSConcat (MP->Conv)
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 30-P4/16
   [-1, 1, CST, [512 ]],  #  CST


   [-1, 1, Conv, [256, 1, 1]],  # W-ELAN 1
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, MyConcat4, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 39 

   [-1, 1, Conv, [512, 3, 2]],  # CBSConcat (MP->Conv)
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 44-P5/32

   [-1, 1, Conv, [256, 1, 1]],  # W-ELAN 1
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, MyConcat4, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 52
   [-1, 1, MCS, [1024 ]],  # MCS
  ]

# cst-yolo neck & head
head:
  [[-1, 1, SPPCSPC, [512]],  # 54

   [-1, 1, Conv, [256, 1, 1]],  # CBS
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # Upsample
   [38, 1, Conv, [256, 1, 1]],  # CBS
   [[-1, -2], 1, Concat, [1]], 

   [-1, 1, Conv, [256, 1, 1]],  # W-ELAN 2
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 65

   [-1, 1, Conv, [128, 1, 1]],  # CBS
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # Upsample
   [24, 1, Conv, [128, 1, 1]],  # CBS
   [[-1, -2], 1, Concat, [1]],  # 69

   [-1, 1, Conv, [128, 1, 1]],  # W-ELAN 2
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 75

   [-1, 1, Conv, [128, 3, 2]],  # CatConv (MP->Conv)
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [69, 1, Conv, [128, 3, 2]],  # add
   [[-1,-2, -4, 66], 1, MyConcat4, [1]],

   [-1, 1, Conv, [256, 1, 1]],  # W-ELAN 2
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 89

   [-1, 1, Conv, [256, 3, 2]],  # CatConv (MP->Conv)
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [57, 1, Conv, [256, 3, 2]],  # add 
   [[-1,-2, -4, 54], 1, MyConcat4, [1]],

   [-1, 1, Conv, [512, 1, 1]],  # W-ELAN 2
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 103

   [77, 1, RepConv, [256, 3, 1]],
   [91, 1, RepConv, [512, 3, 1]],
   [105, 1, RepConv, [1024, 3, 1]],

   [[106,107,108], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
